// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let number1 = prompt('Введіть перше число', [3]);
// let number2 = prompt('Введіть друге число', [2]);
//
// let bigNumber = ''
// if (number1 > number2){
//     console.log(number1)
// } else if (number1 === number2){
//     console.log(number1 + '=' + number2)
// } else {
//     console.log(number2)
// };

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let apartmentNumber = prompt();
//
// if (apartmentNumber <= 20) {
//     console.log('перший під"їзд')
// } else if (apartmentNumber > 20 && apartmentNumber <=48) {
//     console.log('другий під"їзд')
// } else {
//     console.log('третій Під"їзд')
// };


//Тернарний оператор

// let apartmentNumber = prompt();
//
// let padik = (apartmentNumber <= 20) ? 'перший під"їзд' :
//     (apartmentNumber > 20 && apartmentNumber <= 48) ? 'другий під"їзд' :
//         'третій Під"їзд';
// console.log(padik);

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = prompt();
// if (number === 10){
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// };


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = prompt();
//
// if (typeof x === "number") {
//     console.log(1)
// } else if (typeof x === "string") {
//     console.log(2)
// } else if (typeof x === "boolean") {
//     console.log(3)
// } else if (typeof x === "object") {
//     console.log(3)
// } else {
//     console.log('Невірно!')
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = prompt('Введіть значення температури');
//
// if (temperature >= 10 && temperature <=22){
//     console.log('ми йдемо ВЧИТИСЯ')
// } else {
//     console.log('сидимо вдома і вчимося ОНЛАЙН')
// };


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let number = +prompt('Від 1 до 5');
//
// switch (number) {
//     case 1:
//         console.log('Авто');
//         break;
//     case 2:
//         console.log('Мото');
//         break;
//     case 3:
//         console.log('Телефон');
//         break;
//     case 4:
//         console.log('Ноутбук');
//         break;
//     case 5:
//         console.log('Літак');
//         break;
//     default:
//         console.log('число не вірне ...')
// }